#### 📋 Linode Terraform Plan

```
linode_instance.proxy: Preparing import... [id=91377316]
data.linode_domain.kaylabs: Reading...
linode_instance.proxy: Refreshing state... [id=91377316]
data.linode_domain.kaylabs: Read complete after 0s
linode_domain_record.proxy: Preparing import... [id=42885058]
linode_firewall.proxy: Preparing import... [id=3789034]
linode_firewall.proxy: Refreshing state... [id=3789034]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)
-/+ destroy and then create replacement

OpenTofu planned the following actions, but then encountered a problem:

  # linode_firewall.proxy will be updated in-place
  # (imported from "3789034")
  ~ resource "linode_firewall" "proxy" {
        created         = "2026-02-09T14:50:12Z"
        devices         = [
            {
                entity_id = 91377316
                id        = 9967568
                label     = "proxy"
                type      = "linode"
                url       = "/v4/linode/instances/91377316"
            },
        ]
        disabled        = false
        id              = "3789034"
        inbound_policy  = "DROP"
        label           = "proxy-firewall"
      ~ linodes         = [
          - 91377316,
          + (known after apply),
        ]
        nodebalancers   = []
        outbound_policy = "ACCEPT"
        status          = "enabled"
        tags            = []
      ~ updated         = "2026-02-09T17:59:43Z" -> (known after apply)

        inbound {
            action   = "ACCEPT"
            ipv4     = [
                "84.49.166.255/32",
            ]
            label    = "allow-ssh"
            ports    = "22"
            protocol = "TCP"
        }
        inbound {
            action   = "ACCEPT"
            ipv4     = [
                "0.0.0.0/0",
            ]
            ipv6     = [
                "::/0",
            ]
            label    = "allow-http"
            ports    = "80"
            protocol = "TCP"
        }
        inbound {
            action   = "ACCEPT"
            ipv4     = [
                "0.0.0.0/0",
            ]
            ipv6     = [
                "::/0",
            ]
            label    = "allow-https"
            ports    = "443"
            protocol = "TCP"
        }
    }

  # linode_instance.proxy must be replaced
  # (imported from "91377316")
  # Warning: this will destroy the imported resource
-/+ resource "linode_instance" "proxy" {
      + authorized_keys    = [ # forces replacement
          + "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFevEp7Lr1gES/dhSgXHqxyFdagHSwQvr4gDO3sM5i8+ kay@kaylabs.cc",
        ]
      ~ backups            = [
          - {
              - available = false
              - enabled   = false
              - schedule  = [
                  - {
                      - day    = ""
                      - window = ""
                    },
                ]
            },
        ] -> (known after apply)
      ~ backups_enabled    = false -> (known after apply)
      ~ boot_config_label  = "My Ubuntu 24.04 LTS Disk Profile" -> (known after apply)
        booted             = true
      ~ capabilities       = [
          - "Block Storage Encryption",
          - "Maintenance Policy",
        ] -> (known after apply)
      ~ disk_encryption    = "enabled" -> (known after apply)
      ~ has_user_data      = false -> (known after apply)
      ~ host_uuid          = "2a5387bdc5746ea178e61108b855c5da3285de9f" -> (known after apply)
      ~ id                 = "91377316" -> (known after apply)
      + image              = "linode/ubuntu24.04" # forces replacement
      ~ ip_address         = "139.162.156.188" -> (known after apply)
      ~ ipv4               = [
          - "139.162.156.188",
        ] -> (known after apply)
      ~ ipv6               = "2a01:7e01::2000:35ff:fe7a:6bbf/128" -> (known after apply)
        label              = "proxy"
      ~ lke_cluster_id     = 0 -> (known after apply)
      + migration_type     = "cold"
      - private_ip         = false -> null
      + private_ip_address = (known after apply)
        region             = "eu-central"
      + resize_disk        = false
      + root_pass          = (sensitive value) # forces replacement
      ~ shared_ipv4        = [] -> (known after apply)
      ~ specs              = [
          - {
              - accelerated_devices = 0
              - disk                = 25600
              - gpus                = 0
              - memory              = 1024
              - transfer            = 1000
              - vcpus               = 1
            },
        ] -> (known after apply)
      ~ status             = "running" -> (known after apply)
      ~ swap_size          = 512 -> (known after apply)
        tags               = [
            "infra",
            "proxy",
        ]
        type               = "g6-nanode-1"
        watchdog_enabled   = true

      ~ alerts {
          + authorized_keys                    = (known after apply)
          + authorized_users                   = (known after apply)
          + backup_id                          = (known after apply)
          + backups                            = (known after apply)
          + backups_enabled                    = (known after apply)
          + boot_config_label                  = (known after apply)
          + booted                             = (known after apply)
          + capabilities                       = (known after apply)
          + disk_encryption                    = (known after apply)
          + firewall_id                        = (known after apply)
          + group                              = (known after apply)
          + has_user_data                      = (known after apply)
          + host_uuid                          = (known after apply)
          + id                                 = (known after apply)
          + image                              = (known after apply)
          + ip_address                         = (known after apply)
          + ipv4                               = (known after apply)
          + ipv6                               = (known after apply)
          + label                              = (known after apply)
          + lke_cluster_id                     = (known after apply)
          + migration_type                     = (known after apply)
          + placement_group_externally_managed = (known after apply)
          + private_ip                         = (known after apply)
          + private_ip_address                 = (known after apply)
          + region                             = (known after apply)
          + resize_disk                        = (known after apply)
          + root_pass                          = (known after apply)
          + shared_ipv4                        = (known after apply)
          + specs                              = (known after apply)
          + stackscript_data                   = (known after apply)
          + stackscript_id                     = (known after apply)
          + status                             = (known after apply)
          + swap_size                          = (known after apply)
          + tags                               = (known after apply)
          + type                               = (known after apply)
          + watchdog_enabled                   = (known after apply)
        } -> (known after apply)

      ~ config {
          + authorized_keys                    = (known after apply)
          + authorized_users                   = (known after apply)
          + backup_id                          = (known after apply)
          + backups                            = (known after apply)
          + backups_enabled                    = (known after apply)
          + boot_config_label                  = (known after apply)
          + booted                             = (known after apply)
          + capabilities                       = (known after apply)
          + disk_encryption                    = (known after apply)
          + firewall_id                        = (known after apply)
          + group                              = (known after apply)
          + has_user_data                      = (known after apply)
          + host_uuid                          = (known after apply)
          + id                                 = (known after apply)
          + image                              = (known after apply)
          + ip_address                         = (known after apply)
          + ipv4                               = (known after apply)
          + ipv6                               = (known after apply)
          + label                              = (known after apply)
          + lke_cluster_id                     = (known after apply)
          + migration_type                     = (known after apply)
          + placement_group_externally_managed = (known after apply)
          + private_ip                         = (known after apply)
          + private_ip_address                 = (known after apply)
          + region                             = (known after apply)
          + resize_disk                        = (known after apply)
          + root_pass                          = (known after apply)
          + shared_ipv4                        = (known after apply)
          + specs                              = (known after apply)
          + stackscript_data                   = (known after apply)
          + stackscript_id                     = (known after apply)
          + status                             = (known after apply)
          + swap_size                          = (known after apply)
          + tags                               = (known after apply)
          + type                               = (known after apply)
          + watchdog_enabled                   = (known after apply)
        } -> (known after apply)

      ~ disk {
          + authorized_keys                    = (known after apply)
          + authorized_users                   = (known after apply)
          + backup_id                          = (known after apply)
          + backups                            = (known after apply)
          + backups_enabled                    = (known after apply)
          + boot_config_label                  = (known after apply)
          + booted                             = (known after apply)
          + capabilities                       = (known after apply)
          + disk_encryption                    = (known after apply)
          + firewall_id                        = (known after apply)
          + group                              = (known after apply)
          + has_user_data                      = (known after apply)
          + host_uuid                          = (known after apply)
          + id                                 = (known after apply)
          + image                              = (known after apply)
          + ip_address                         = (known after apply)
          + ipv4                               = (known after apply)
          + ipv6                               = (known after apply)
          + label                              = (known after apply)
          + lke_cluster_id                     = (known after apply)
          + migration_type                     = (known after apply)
          + placement_group_externally_managed = (known after apply)
          + private_ip                         = (known after apply)
          + private_ip_address                 = (known after apply)
          + region                             = (known after apply)
          + resize_disk                        = (known after apply)
          + root_pass                          = (known after apply)
          + shared_ipv4                        = (known after apply)
          + specs                              = (known after apply)
          + stackscript_data                   = (known after apply)
          + stackscript_id                     = (known after apply)
          + status                             = (known after apply)
          + swap_size                          = (known after apply)
          + tags                               = (known after apply)
          + type                               = (known after apply)
          + watchdog_enabled                   = (known after apply)
        } -> (known after apply)
    }

Plan: 2 to import, 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + domain_id = 3334262
  + proxy_id  = (known after apply)
  + proxy_ip  = (known after apply)

Warning: Deprecated attribute

  on main.tf line 71, in resource "linode_domain_record" "proxy":
  71:   target      = linode_instance.proxy.ip_address

The attribute "ip_address" is deprecated. Refer to the provider documentation
for details.

(and 2 more similar warnings elsewhere)

Error: failed to parse argument: 42885058

::error::OpenTofu exited with code 1.

```

*Triggered by @bytebotapp[bot]*